javnson/gmp_pro/ctl/suite/mcs_pmsm_nt/project/f280049c/src/user/280049C_LaunchPad.syscfg
eqep2.$name                      = "EQEP2_J13";
eqep2.useCase                    = "NO STROBE";
eqep2.enableModule               = true;
eqep2.positionCounterMax         = 10000;
eqep2.eqep.$assign               = "EQEP2";
eqep2.eqep.eqep_aPin.$assign     = "GPIO14";
eqep2.eqep.eqep_bPin.$assign     = "GPIO15";
eqep2.eqep.eqep_indexPin.$assign = "GPIO26";

gpio1.$name           = "LED_R";
gpio1.direction       = "GPIO_DIR_MODE_OUT";
gpio1.gpioPin.$assign = "GPIO23_VSW";

gpio2.$name           = "LED_G";
gpio2.direction       = "GPIO_DIR_MODE_OUT";
gpio2.gpioPin.$assign = "GPIO34";

gpio3.$name           = "ENABLE_GATE";
gpio3.direction       = "GPIO_DIR_MODE_OUT";
gpio3.gpioPin.$assign = "GPIO13";

gpio4.$name           = "RESET_GATE";
gpio4.direction       = "GPIO_DIR_MODE_OUT";
gpio4.gpioPin.$assign = "GPIO17";

gpio5.direction       = "GPIO_DIR_MODE_OUT";
gpio5.$name           = "MONITOR_IO";
gpio5.gpioPin.$assign = "GPIO57";

sci1.$name                      = "LAUNCHXL_UART_USB";
sci1.selectRegisteredInterrupts = ["registerRxInt"];
sci1.enabledFIFOInterrupts      = ["SCI_INT_RXFF"];
sci1.enabledErrorInterrupts     = ["SCI_INT_FE","SCI_INT_OE"];
sci1.rxFifo                     = "SCI_FIFO_RX14";
sci1.baudRates                  = 256000;
sci1.sci.$assign                = "SCIA";
sci1.sci.sci_rxPin.$assign      = "GPIO28";
sci1.sci.sci_txPin.$assign      = "GPIO29";
sci1.rxQual.$name               = "myGPIOQUAL0";
sci1.txQual.$name               = "myGPIOQUAL1";
sci1.sciRXInt.enableInterrupt   = true;
